# 38.DataFrame

## 38.1 创建方法

In [2]:
    
import numpy as np
import pandas as pd
df1=pd.DataFrame(np.arange(10).reshape(2,5))
df1

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [3]:


df2 = pd.read_csv('bc_data.csv')
df2.shape

(569, 32)

In [4]:
df2=df2[["id","diagnosis","area_mean"]]



df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

## 38.2查看行或列

In [5]:


df2.index

RangeIndex(start=0, stop=569, step=1)

In [6]:


df2.index.size

569

In [7]:


df2.columns

Index(['id', 'diagnosis', 'area_mean'], dtype='object')

In [8]:


df2.columns.size

3

In [9]:

    
df2.shape

(569, 3)

In [10]:


print("行数为:", df2.shape[0])
print("列数为:", df2.shape[1])

行数为: 569
列数为: 3

## 38.3 引用行或列

In [13]:

df2["id"].head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [14]:

df2.id.head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [15]:


df2["id"][2]

84300903

In [16]:


df2.id[2]

84300903

In [17]:


df2["id"][[2,4]]

2    84300903
4    84358402
Name: id, dtype: int64

In [18]:



df2.loc[1,"id"]

842517

In [19]:


df2.iloc[1,0]

842517

In [20]:


df2.ix[[1],["id"]]

C:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

       id
1  842517

In [21]:

df2.ix[[1,5],["id"]]

       id
1  842517
5  843786

In [22]:
df2.ix[1:5,["id"]]

         id
1    842517
2  84300903
3  84348301
4  84358402
5    843786

In [23]:


df2[["area_mean","id"]].head()

   area_mean        id
0     1001.0    842302
1     1326.0    842517
2     1203.0  84300903
3      386.1  84348301
4     1297.0  84358402

## 38.4 index操作

In [24]:

    
df2.index

RangeIndex(start=0, stop=569, step=1)

In [25]:
df2.columns

Index(['id', 'diagnosis', 'area_mean'], dtype='object')

In [26]:


df2["id"].head()

0      842302
1      842517
2    84300903
3    84348301
4    84358402
Name: id, dtype: int64

In [27]:


df2.reindex(index=["1","2","3"],columns=["1","2","3"])
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [28]:
df2.reindex(index=[2,3,1], columns=["diagnosis","id","area_mean"])

  diagnosis        id  area_mean
2         M  84300903     1203.0
3         M  84348301      386.1
1         M    842517     1326.0

In [29]:

df3=df2.reindex(index=[2,3,1], columns=["diagnosis","id","area_mean","MyNewColumn"],fill_value=100)

df3

  diagnosis        id  area_mean  MyNewColumn
2         M  84300903     1203.0          100
3         M  84348301      386.1          100
1         M    842517     1326.0          100

## 38.5 删除或过滤行/列

In [30]:

import pandas as pd
df2 = pd.read_csv('bc_data.csv')


df2=df2[["id","diagnosis","area_mean"]]
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [31]:
df2.drop([2]).head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
3  84348301         M      386.1
4  84358402         M     1297.0
5    843786         M      477.1

In [32]:
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [33]:
import pandas as pd
df2 = pd.read_csv('bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
    
df2.drop([3,4], axis=0, inplace=True)

        
        
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
5    843786         M      477.1
6    844359         M     1040.0

In [34]:

        
        
        
        

import pandas as pd        
df2 = pd.read_csv('bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
df2.drop([3,4], axis=0, inplace=False)
   
df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [35]:


import pandas as pd
df2 = pd.read_csv('bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
del df2["area_mean"] 
df2.head()

         id diagnosis
0    842302         M
1    842517         M
2  84300903         M
3  84348301         M
4  84358402         M

In [36]:


import pandas as pd
df2 = pd.read_csv('bc_data.csv')
df2=df2[["id","diagnosis","area_mean"]]
df2.drop(["id","diagnosis"], axis=1, inplace=True)
  
    
    
    
    
    
df2.head()

   area_mean
0     1001.0
1     1326.0
2     1203.0
3      386.1
4     1297.0

In [37]:


import pandas as pd
df2 =pd.read_csv('bc_data.csv')

df2=df2[["id","diagnosis","area_mean"]]
df2[df2.area_mean> 1000].head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
4  84358402         M     1297.0
6    844359         M     1040.0

In [38]:
df2[df2.area_mean> 1000][["id","diagnosis"]].head()

         id diagnosis
0    842302         M
1    842517         M
2  84300903         M
4  84358402         M
6    844359         M

## 38.6 算术运算

In [39]:


df4=pd.DataFrame(np.arange(6).reshape(2,3))
df4

   0  1  2
0  0  1  2
1  3  4  5

In [40]:
df5=pd.DataFrame(np.arange(10).reshape(2,5)) 
 
    
    
    
    
    
    
    
    
    
    
    
    
    
df5

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [41]:
df4+df5

   0   1   2   3   4
0  0   2   4 NaN NaN
1  8  10  12 NaN NaN

In [42]:


df6=df4.add(df5,fill_value=10)
df6

   0   1   2     3     4
0  0   2   4  13.0  14.0
1  8  10  12  18.0  19.0

In [43]:


s1=pd.Series(np.arange(3))
s1

0    0
1    1
2    2
dtype: int32

In [44]:
df6-s1

     0    1     2   3   4
0  0.0  1.0   2.0 NaN NaN
1  8.0  9.0  10.0 NaN NaN

In [45]:
df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5-s1

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [46]:


df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5.sub(s1,axis=1)

     0    1    2   3   4
0  0.0  0.0  0.0 NaN NaN
1  5.0  5.0  5.0 NaN NaN

In [47]:

    
df5=pd.DataFrame(np.arange(10).reshape(2,5))
s1=pd.Series(np.arange(3))
df5.sub(s1,axis=0)

     0    1    2    3    4
0  0.0  1.0  2.0  3.0  4.0
1  4.0  5.0  6.0  7.0  8.0
2  NaN  NaN  NaN  NaN  NaN

In [48]:
df7=pd.DataFrame(np.arange(20).reshape(4,5))
df7

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [49]:
df7+2

    0   1   2   3   4
0   2   3   4   5   6
1   7   8   9  10  11
2  12  13  14  15  16
3  17  18  19  20  21

In [50]:


print(df7)
print("df7.cumsum=",df7.cumsum())

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
df7.cumsum=     0   1   2   3   4
0   0   1   2   3   4
1   5   7   9  11  13
2  15  18  21  24  27
3  30  34  38  42  46

In [51]:
df7

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [52]:
df7.rolling(2).sum()

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   5.0   7.0   9.0  11.0  13.0
2  15.0  17.0  19.0  21.0  23.0
3  25.0  27.0  29.0  31.0  33.0

In [53]:
df7.rolling(2,axis=1).sum()

    0     1     2     3     4
0 NaN   1.0   3.0   5.0   7.0
1 NaN  11.0  13.0  15.0  17.0
2 NaN  21.0  23.0  25.0  27.0
3 NaN  31.0  33.0  35.0  37.0

In [54]:
df7.cov()

           0          1          2          3          4
0  41.666667  41.666667  41.666667  41.666667  41.666667
1  41.666667  41.666667  41.666667  41.666667  41.666667
2  41.666667  41.666667  41.666667  41.666667  41.666667
3  41.666667  41.666667  41.666667  41.666667  41.666667
4  41.666667  41.666667  41.666667  41.666667  41.666667

In [55]:
df7.corr()

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0  1.0

In [56]:


import pandas as pd
df2 = pd.read_csv('bc_data.csv')

df2=df2[["id","diagnosis","area_mean"]][2:5]
df2.T

                  2         3         4
id         84300903  84348301  84358402
diagnosis         M         M         M
area_mean      1203     386.1      1297

## 38.7 大小比较运算

In [57]:
print(df6)

   0   1   2     3     4
0  0   2   4  13.0  14.0
1  8  10  12  18.0  19.0

In [58]:
df6>5

       0      1      2     3     4
0  False  False  False  True  True
1   True   True   True  True  True

In [59]:
print(s1)

0    0
1    1
2    2
dtype: int32

In [60]:
df6>s1

       0     1     2      3      4
0  False  True  True  False  False
1   True  True  True  False  False

In [61]:
df6>(2,18)

       0      1      2      3     4
0  False  False   True   True  True
1  False  False  False  False  True

## 38.8 统计信息

In [62]:

    
import numpy as np
import pandas as pd

df2 = pd.read_csv('bc_data.csv')

df2=df2[["id","diagnosis","area_mean"]]

df2.describe()

                 id    area_mean
count  5.690000e+02   569.000000
mean   3.037183e+07   654.889104
std    1.250206e+08   351.914129
min    8.670000e+03   143.500000
25%    8.692180e+05   420.300000
50%    9.060240e+05   551.100000
75%    8.813129e+06   782.700000
max    9.113205e+08  2501.000000

In [63]:


dt = df2[df2.diagnosis=='M']

In [64]:


dt.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [65]:
dt.tail()

         id diagnosis  area_mean
563  926125         M     1347.0
564  926424         M     1479.0
565  926682         M     1261.0
566  926954         M      858.1
567  927241         M     1265.0

In [66]:


df2[df2.diagnosis=='M'].count()

id           212
diagnosis    212
area_mean    212
dtype: int64

In [67]:


df2[["area_mean","id"]].head()

   area_mean        id
0     1001.0    842302
1     1326.0    842517
2     1203.0  84300903
3      386.1  84348301
4     1297.0  84358402

## 38.9 排序

In [68]:


df2.head(8)

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0
5    843786         M      477.1
6    844359         M     1040.0
7  84458202         M      577.9

In [69]:


df2.sort_values(by="area_mean",axis=0,ascending=True).head()

           id diagnosis  area_mean
101    862722         B      143.5
539    921362         B      170.4
538    921092         B      178.8
568     92751         B      181.0
46   85713702         B      201.9

In [70]:


df2.sort_index(axis=1).head(3)

   area_mean diagnosis        id
0     1001.0         M    842302
1     1326.0         M    842517
2     1203.0         M  84300903

In [71]:
df2.sort_index(axis=0,ascending=False).head(3)

         id diagnosis  area_mean
568   92751         B      181.0
567  927241         M     1265.0
566  926954         M      858.1

## 38.10导入/导出

In [72]:


    
import os
print(os.getcwd())

C:\Users\soloman\clm

In [73]:


df2.head(3).to_csv("df2.csv")

In [74]:


import pandas as pd
df3 = pd.read_csv('df2.csv')

In [75]:
df3

   Unnamed: 0        id diagnosis  area_mean
0           0    842302         M     1001.0
1           1    842517         M     1326.0
2           2  84300903         M     1203.0

In [76]:


df3 = pd.read_csv('df2.csv')

In [77]:
df3

   Unnamed: 0        id diagnosis  area_mean
0           0    842302         M     1001.0
1           1    842517         M     1326.0
2           2  84300903         M     1203.0

In [78]:


df2.head(3).to_excel("df3.xls")

In [79]:


df3 = pd.read_excel("df3.xls")
df3

         id diagnosis  area_mean
0    842302         M       1001
1    842517         M       1326
2  84300903         M       1203

## 38.11 缺失数据处理

In [80]:

df3.empty

False

In [81]:

np.nan-np.nan +1

nan

In [82]:
np.nan-np.nan

nan

In [83]:
None+1

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [84]:
import pandas as pd
import numpy as np
A=pd.DataFrame(np.array([10,10,20,20]).reshape(2,2),columns=list("ab"),index=list("SW"))
A

    a   b
S  10  10
W  20  20

In [85]:


list("ab")

['a', 'b']

In [86]:
B=pd.DataFrame(np.array([1,1,1,2,2,2,3,3,3]).reshape(3,3), columns=list("abc"),index=list("SWT"))
B

   a  b  c
S  1  1  1
W  2  2  2
T  3  3  3

In [87]:
C=A+B 


C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [88]:

    
A.add(B,fill_value=0)

      a     b    c
S  11.0  11.0  1.0
T   3.0   3.0  3.0
W  22.0  22.0  2.0

In [89]:
A.add(B,fill_value=A.stack().mean())

      a     b     c
S  11.0  11.0  16.0
T  18.0  18.0  18.0
W  22.0  22.0  17.0

In [90]:

A.mean()

a    15.0
b    15.0
dtype: float64

In [91]:
A.stack()

S  a    10
   b    10
W  a    20
   b    20
dtype: int32

In [92]:
A.stack().mean()

15.0

In [93]:

C

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

In [94]:

C.isnull()

       a      b     c
S  False  False  True
T   True   True  True
W  False  False  True

In [95]:

C.notnull()

       a      b      c
S   True   True  False
T  False  False  False
W   True   True  False

In [96]:

C.dropna(axis='index')

Empty DataFrame
Columns: [a, b, c]
Index: []

In [97]:


C.fillna(0)

      a     b    c
S  11.0  11.0  0.0
T   0.0   0.0  0.0
W  22.0  22.0  0.0

In [98]:
C.fillna(method="ffill")

      a     b   c
S  11.0  11.0 NaN
T  11.0  11.0 NaN
W  22.0  22.0 NaN

In [99]:
C.fillna(method="bfill",axis=1)

      a     b   c
S  11.0  11.0 NaN
T   NaN   NaN NaN
W  22.0  22.0 NaN

## 38.12 分组统计

In [100]:

import pandas as pd
df2 = pd.read_csv('bc_data.csv')


df2=df2[["id","diagnosis","area_mean"]]


df2.head()

         id diagnosis  area_mean
0    842302         M     1001.0
1    842517         M     1326.0
2  84300903         M     1203.0
3  84348301         M      386.1
4  84358402         M     1297.0

In [101]:

    
df2.groupby("diagnosis")["area_mean"].mean()

diagnosis
B    462.790196
M    978.376415
Name: area_mean, dtype: float64

In [102]:

    
df2.groupby("diagnosis")["area_mean"].aggregate(["mean","sum","max",np.median])

                 mean       sum     max  median
diagnosis
B          462.790196  165216.1   992.1   458.4
M          978.376415  207415.8  2501.0   932.0

In [103]:
df2.groupby("diagnosis")["area_mean"].aggregate(["mean","sum"]).unstack()

      diagnosis
mean  B               462.790196
      M               978.376415
sum   B            165216.100000
      M            207415.800000
dtype: float64

In [104]:

    
def myfunc(x):
   x["area_mean"]/=x["area_mean"].sum()
   return x

df2.groupby("diagnosis").apply(myfunc).head()

         id diagnosis  area_mean
0    842302         M   0.004826
1    842517         M   0.006393
2  84300903         M   0.005800
3  84348301         M   0.001861
4  84358402         M   0.006253